{
    "films": [
        {
            "id": 0,
            "name": "Бэтмен: Начало",
            "image": "images/batman.jpg",
            "year": 2005,
            "country": "США",
            "genres": ["Боевик", "Фантастика", "Приключения", "Драма"],
            "director": "Кристофер Нолан",
            "rating": 7.9,
            "description": "В детстве юный наследник огромного состояния Брюс Уэйн оказался свидетелем убийства своих родителей, и тогда он решил бороться с преступностью. Спустя годы он отправляется в путешествие по миру, чтобы найти способ восстановить справедливость. Обучение у мудрого наставника боевым искусствам дает ему силу и смелость. Вернувшись в родной город, Уэйн становится Бэтменом и ведет борьбу со злом."
        },
        {
            "id": 1,
            "name": "Мост в Терабитию",
            "image": "images/bridge.jpg",
            "year": 2006,
            "country": "США",
            "genres": ["Фэнтези", "Драма", "Приключения", "Семейный"],
            "director": "Габор Чупо",
            "rating": 7.8,
            "description": "Надежды ученика пятого класса Джесса Аарона стать самым быстрым бегуном в классе разбились после того, как новичок Лесли Берк одержала победу в соревнованиях. Оснований для враждебности по отношению друг к друг у Джесса и Лесли более чем достаточно, и тем не менее между ними завязывается дружба. Как тут не подружиться, если приходится быть королем и королевой в обнаруженном в лесу волшебном царстве?"
        },
        {
            "id": 2,
            "name": "About Time",
            "image": "images/about_time.jpg",
            "year": 2013,
            "country": "США, Великобритания",
            "genres": ["Фантастика", "Фэнтези", "Драма", "Мелодрама", "Комедия"],
            "director": "Ричард Кёртис",
            "rating": 7.9,
            "description": "Тиму повезло – он молодой, симпатичный, многообещающий адвокат, а еще он… умеет перемещаться во времени. И чтобы очаровать девушку своей мечты, он готов повторять первое свидание вновь и вновь. Воистину, любовь с первого взгляда не всегда выходит с первого раза..."
        },
        {
            "id": 3,
            "name": "500 дней лета",
            "image": "images/summer.jpg",
            "year": 2009,
            "country": "США",
            "genres": ["Мелодрама", "Комедия"],
            "director": "Марк Уэбб",
            "rating": 7.6,
            "description": "Главный герой работает в агентстве, выпускающем поздравительные открытки. Он придумывает все те забавные подписи, которые мы с Вами читаем на них. Молодой человек влюбляется в свою коллегу и решает, что она - «та, единственная». Но 500 дней их отношений показывают герою, что путь к счастью непредсказуем, неконтролируем и - невероятно забавен!"
        },
        {
            "id": 4,
            "name": "Эффект бабочки",
            "image": "images/butterfly.jpg",
            "year": 2003,
            "country": "США, Канада",
            "genres": ["Фантастика", "Триллер", "Драма"],
            "director": "Эрик Бресс, Дж. Макки Грубер",
            "rating": 8.2,
            "description": "Эван перенял от своего отца-психопата, ныне запертого в доме для умалишённых, странную болезнь — он не помнит некоторых эпизодов своей жизни, причем в эти моменты происходили довольно странные, а то и ужасные события. Поступив в колледж, Эван делает удивительное открытие. Читая дневники, которые писал в детстве по совету врача, он может возвращаться в детство и менять будущее."
        },
        {
            "id": 5,
            "name": "А в душе я танцую",
            "image": "images/dancing.jpg",
            "year": 2004,
            "country": "Великобритания, Ирландия, Франция",
            "genres": ["Драма", "Комедия", "Мелодрама"],
            "director": "Дэмиен О'Доннелл",
            "rating": 8.1,
            "description": "Майклу 24 года, и почти всю свою жизнь он провел в доме для инвалидов, куда попал с церебральным параличом. Он знакомится с новым пациентом клиники — Рори О'Ши, которого приковала к инвалидной коляске мышечная атрофия. Как и Майкл, он практически не может передвигаться, но это не мешает Рори по-своему наслаждаться жизнью. Его смелость и безразличие к ударам судьбы становятся отличным примером для Майкла."
        },
        {
            "id": 6,
            "name": "Finding Neverland",
            "image": "images/neverland.jpg",
            "year": 2004,
            "country": "США, Великобритания",
            "genres": ["Драма", "Семейный", "Биография"],
            "director": "Марк Форстер",
            "rating": 7.9,
            "description": "Писатель-неудачник Дж. Меттью Барри не повинуется законам консервативного Лондона и становится другом одинокой вдовы, а также приемным отцом ее четырем маленьким сыновьям. Новая семья дарит вдохновение: писатель создает детского героя Питера Пена и чудесную сказку о детях, которые не хотят взрослеть…"
        },
        {
            "id": 7,
            "name": "Гордость и предубеждение",
            "image": "images/pride_and_prejudice.jpg",
            "year": 2005,
            "country": "Великобритания, Франция, США",
            "genres": ["Драма", "Мелодрама"],
            "director": "Джо Райт",
            "rating": 8.2,
            "description": "Англия, конец XVIII века. Родители пятерых сестер Беннет озабочены тем, чтобы удачно выдать дочерей замуж. И потому размеренная жизнь солидного семейства переворачивается вверх дном, когда по соседству появляется молодой джентльмен - мистер Бингли... Само собой, среди друзей нового соседа оказывается немало утонченных аристократов, которые не прочь поухаживать за очаровательными сестрами. Однако, все не так просто. Своевольная Элизабет знакомится с другом Бингли - красивым и высокомерным мистером Дарси, и между ними разгорается нешуточное противостояние, результатом которого может стать как любовь, так и ненависть..."
        },
        {
            "id": 8,
            "name": "Искупление",
            "image": "images/atonement.jpg",
            "year": 2007,
            "country": "Великобритания, Франция, США",
            "genres": ["Драма", "Мелодрама", "Детектив", "Военный"],
            "director": "Джо Райт",
            "rating": 8.1,
            "description": "Действие фильма начинается в 1935 году и разворачивается на фоне Второй мировой войны. Талантливая тринадцатилетняя писательница Бриони Таллис бесповоротно меняет ход нескольких жизней, когда обвиняет любовника старшей сестры в преступлении, которого он не совершал."
        },
        {
            "id": 9,
            "name": "Поймай меня, если сможешь",
            "image": "images/catch.jpg",
            "year": 2002,
            "country": "США, Канада",
            "genres": ["Криминал", "Биография", "Комедия"],
            "director": "Стивен Спилберг",
            "rating": 8.5,
            "description": "Фрэнк Эбегнейл успел поработать врачом, адвокатом и пилотом на пассажирской авиалинии – и все это до достижения полного совершеннолетия в 21 год. Мастер в обмане и жульничестве, он также обладал искусством подделки документов, что в конечном счете принесло ему миллионы долларов, которые он получил по фальшивым чекам. Агент ФБР Карл Хэнрэтти отдал бы все, чтобы схватить Фрэнка и привлечь к ответственности за свои деяния, но Фрэнк всегда опережает его на шаг, заставляя продолжать погоню."
        },
        {
            "id": 10,
            "name": "Трасса 60",
            "image": "images/interstate.jpg",
            "year": 2001,
            "country": "Канада, США",
            "genres": ["Фэнтези", "Драма", "Комедия", "Приключения", "Фантастика"],
            "director": "Боб Гейл",
            "rating": 8.1,
            "description": "Нил Оливер, на первый взгляд, вполне доволен своей жизнью: у него обеспеченные родители, милая девушка, а впереди — обучение на юриста в престижном университете. Однако будущее Нила определяет отец, не особо интересуясь мнением сына. Парень же мечтает стать художником, но отказать родителю не решается. С недавних пор ему стала сниться девушка, которую он никак не может выбросить из головы. Однажды загадочный мужчина Рэй предлагает ему доставить посылку и совершить поездку по автостраде 60, которой нет ни на одной карте США. В пути он встречает чудаковатого О. В. Гранта, вместе с которым отправляется навстречу приключениям, пытаясь разыскать незнакомку из своих снов."
        },
        {
            "id": 11,
            "name": "Место под соснами",
            "image": "images/pines.jpg",
            "year": 2012,
            "country": "США",
            "genres": ["Триллер", "Драма", "Криминал"],
            "director": "Дерек Сиенфрэнс",
            "rating": 7.3,
            "description": "Мотокаскадер Люк Глэнтон совершает турне из одной провинции в другую, показывая свои каскадерские навыки и зарабатывая этим на жизнь. По окончании одного из своих выступлений он встречает свою бывшую девушку - Ромину, вскоре узнав, что у нее от него годовалый сын - Джейсон. Решив обеспечивать сына он бросает свою работу каскадера, однако Ромина против того, чтобы Люк был в жизни ее сына, поскольку она сама вовлечена в отношения с Кофи. Тем не менее, Люк остается в городе и устраивается на работу к механику Робину, но вскоре понимает, что заработанных денег не хватает для обеспечения семьи. Робин предлагает ему ограбить банк..."
        },
        {
            "id": 12,
            "name": "Привидение",
            "image": "images/ghost.jpg",
            "year": 1990,
            "country": "США",
            "genres": ["Мелодрама", "Фэнтези", "Триллер", "Драма"],
            "director": "Джерри Цукер",
            "rating": 8.2,
            "description": "Влюблённая пара Сэм и Молли возвращается домой после приятного вечера, когда на них нападает грабитель. Защищаясь, Сэм погибает и становится призраком. Он узнаёт, что его смерть не была случайной, а над его возлюбленной нависла смертельная опасность. Чтобы предупредить Молли, Сэм начинает обход практикующих медиумов и, о чудо! - находит женщину, которая действительно может его слышать. Только вот сама она не горит желанием помогать назойливому привидению."
        },
        {
            "id": 13,
            "name": "Человек-паук",
            "image": "images/spider.jpg",
            "year": 2002,
            "country": "США",
            "genres": ["Фантастика", "Боевик", "Приключения"],
            "director": "Сэм Рэйми",
            "rating": 7.8,
            "description": "Питер Паркер – обыкновенный школьник. Однажды он отправился с классом на экскурсию, где его кусает странный паук-мутант. Через время парень почувствовал в себе нечеловеческую силу и ловкость в движении, а главное – умение лазать по стенам и метать стальную паутину. Свои способности он направляет на защиту слабых. Так Питер становится настоящим супергероем по имени Человек-паук, который помогает людям и борется с преступностью. Но там, где есть супергерой, рано или поздно всегда объявляется и суперзлодей..."
        }
    ]
}
